# GEOSPACIAL VISUALIZATION PROJECT

- Mi empresa:
    - Compañia de software con 50 empleados.
    - Producto: videojuegos
    - Empleados: 20 developers, 20 Designers/Creatieves/UX/UI and 10 executives/managers
     
- Requisitos buscados para localizar la empresa:

        --> offices.latitude
        --> offices.longitude
        
    - Debe haber software engineers trabajando cerca:
        --> category_code: 'software','web','biotech','mobile','hardware','games_video','ecommerce','enterprise','public_relations','consulting'
    
    - Debe haber un buen ratio entre grandes compañias / startups
        --> number_of_employees: 0-100 small; 100-999 medium; >1000 big
        --> ipo.valuation_amount
        --> total_money_raised
    
    - Empresas cercanas deben cubrir los intereses de mis trabajadores --> Text mining
        --> description
        --> tag_list
    
    - Prefiero estar cerca de compañias nuevas que viejas
        --> deadpooled_year: null
        --> founded_year
      
    --> twitter_username: nº de seguidores, nºtweets, text mining (topics)

CAMPOS DEL DATASET:

offices.latitude; offices.longitude; 
category_code
number_of_employees; ipo.valuation_amount; total_money_raised
description; tag_list; twitter_username
founded_year; deadpooled_year: null

In [1]:
import pymongo
MongoClient = pymongo.MongoClient
client = MongoClient()
db = client.companies

1. Crear un cursor con los campos que me interesan y filtrando de entrada ciertas empresas.

In [2]:
companies_interest = db.companies.find({"deadpooled_year": None},
                                       {"_id":0,"category_code":1,"number_of_employees":1,"ipo.valuation_amount":1,
                                       "total_money_raised":1,"description":1,
                                       "tag_list":1,"founded_year":1,"twitter_username":1,
                                       "offices.latitude":1,"offices.longitude":1})

companies_interest = list(companies_interest)

In [3]:
import pandas as pd

df_companies = pd.DataFrame(companies_interest)
df_companies.head(20)

df_companies.shape
df_companies.isnull().sum()

category_code           2741
description             6160
founded_year            5447
ipo                    17482
number_of_employees     9469
offices                    0
tag_list                3999
total_money_raised         0
twitter_username        6996
dtype: int64

In [4]:
df_companies.category_code.unique()

array(['news', 'games_video', 'web', 'music', 'mobile', 'social',
       'search', 'advertising', 'messaging', 'photo_video', 'security',
       'finance', 'network_hosting', 'software', 'ecommerce',
       'enterprise', 'travel', 'hardware', 'public_relations', 'other',
       'real_estate', 'semiconductor', 'analytics', 'health', 'legal',
       'sports', 'biotech', 'cleantech', 'education', 'consulting',
       'transportation', None, 'hospitality', 'fashion', 'nonprofit',
       'nanotech', 'automotive', 'design', 'manufacturing', 'government',
       'local', 'medical'], dtype=object)

In [5]:
df_companies.describe()

       founded_year  number_of_employees
count  12425.000000          8403.000000
mean    2002.243058           840.450315
std       13.328602         11384.038864
min     1800.000000             0.000000
25%     2001.000000             4.000000
50%     2006.000000            10.000000
75%     2008.000000            35.000000
max     2013.000000        405000.000000

In [6]:
df_companies.head(5)

,category_code,description,founded_year,ipo,number_of_employees,offices,tag_list,total_money_raised,twitter_username
0,news,user driven social content website,2004.0,NaN,60.0,"[{'latitude': 37.764726, 'longitude': -122.394...","community, social, news, bookmark, digg, techn...",$45M,digg
1,games_video,None,NaN,NaN,NaN,"[{'latitude': 34.025958, 'longitude': -118.379...","flektor, photo, video",$0,None
2,web,None,1999.0,NaN,NaN,"[{'latitude': 37.506885, 'longitude': -122.247...",,$0,None
3,web,Geneology social network site,2006.0,NaN,18.0,"[{'latitude': 34.090368, 'longitude': -118.393...","geni, geneology, social, family, genealogy",$16.5M,geni
4,web,,1979.0,NaN,0.0,"[{'latitude': 34.076179, 'longitude': -118.394...",,$0,twitterapi

In [7]:
df_= pd.DataFrame(pd.DataFrame(df_companies["offices"].values.flatten([0]).tolist()))
df_companies = pd.concat([df_,df_companies],axis=1)

df_companies.columns

/usr/lib/python3/dist-packages/ipykernel_launcher.py:1: DeprecationWarning: Non-string object detected for the array ordering. Please pass in 'C', 'F', 'A', or 'K' instead
  """Entry point for launching an IPython kernel.

Index([                    0,                     1,                     2,
                           3,                     4,                     5,
                           6,                     7,                     8,
                           9,                    10,                    11,
                          12,                    13,                    14,
                          15,                    16,                    17,
                          18,                    19,                    20,
                          21,                    22,                    23,
                          24,                    25,                    26,
                          27,                    28,                    29,
                          30,                    31,                    32,
                          33,                    34,                    35,
                          36,                    37,                    38,
                          39,                    40,                    41,
                          42,                    43,                    44,
                          45,                    46,                    47,
                          48,                    49,                    50,
                          51,                    52,                    53,
                          54,                    55,                    56,
                          57,                    58,                    59,
                          60,                    61,                    62,
                          63,                    64,                    65,
                          66,       'category_code',         'description',
              'founded_year',                 'ipo', 'number_of_employees',
                   'offices',            'tag_list',  'total_money_raised',
          'twitter_username'],
      dtype='object')

In [8]:
type(df_companies)

pandas.core.frame.DataFrame

In [9]:
df_companies = df_companies[[0,'category_code','description','founded_year','number_of_employees','tag_list','total_money_raised','twitter_username']].copy()

In [10]:
df_companies.columns  = ['coordenadas','Category','Description','Founded_year','number_of_employees',
                          'tag_list','total_money_raised','twitter']

df_companies.head(5)

,coordenadas,Category,Description,Founded_year,number_of_employees,tag_list,total_money_raised,twitter
0,"{'latitude': 37.764726, 'longitude': -122.394523}",news,user driven social content website,2004.0,60.0,"community, social, news, bookmark, digg, techn...",$45M,digg
1,"{'latitude': 34.025958, 'longitude': -118.379768}",games_video,None,NaN,NaN,"flektor, photo, video",$0,None
2,"{'latitude': 37.506885, 'longitude': -122.247573}",web,None,1999.0,NaN,,$0,None
3,"{'latitude': 34.090368, 'longitude': -118.393064}",web,Geneology social network site,2006.0,18.0,"geni, geneology, social, family, genealogy",$16.5M,geni
4,"{'latitude': 34.076179, 'longitude': -118.39417}",web,,1979.0,0.0,,$0,twitterapi

In [11]:
df_companies.isnull().sum()

coordenadas            4915
Category               2741
Description            6160
Founded_year           5447
number_of_employees    9469
tag_list               3999
total_money_raised        0
twitter                6996
dtype: int64

In [12]:
#elimino las filas que no tengan valor en founded year o en number of employees

import numpy as np

df_companies = df_companies[np.isfinite(df_companies['Founded_year'])]
df_companies = df_companies[np.isfinite(df_companies['number_of_employees'])]

df_companies.isnull().sum()

coordenadas            1244
Category                 42
Description            2144
Founded_year              0
number_of_employees       0
tag_list                198
total_money_raised        0
twitter                2651
dtype: int64

In [17]:
df_companies.head()

,coordenadas,Category,Description,Founded_year,number_of_employees,tag_list,total_money_raised,twitter
0,"{'latitude': 37.764726, 'longitude': -122.394523}",news,user driven social content website,2004.0,60.0,"community, social, news, bookmark, digg, techn...",$45M,digg
3,"{'latitude': 34.090368, 'longitude': -118.393064}",web,Geneology social network site,2006.0,18.0,"geni, geneology, social, family, genealogy",$16.5M,geni
4,"{'latitude': 34.076179, 'longitude': -118.39417}",web,,1979.0,0.0,,$0,twitterapi
10,"{'latitude': 37.789634, 'longitude': -122.404052}",news,Read Unlimited Books,2007.0,50.0,"book-subscription, digital-library, netflix-fo...",$25.8M,scribd
11,"{'latitude': 40.757929, 'longitude': -73.985506}",social,Mobile Dating,2007.0,15.0,"mobile, dating, location, realtime, phone",$5.58M,meetmoi

In [ ]:
'''
def toGeoJSON(array):
    return {
        "type":"Point",
        "coordinates":[array[0],array[1]]
    }


toGeoJSON(df_companies['coordenadas'])
'''